[
    {
      "officialRaceName": "Albert Park Grand Prix Circuit",
      "circuitId": "albert_park",
      "trackStartDate": "1996",
      "years": [1996, 1997, 1998, 1999, 2000, 2001, 2002, 2004, 2005, 2006, 2007, 2009, 2010, 2011, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2022, 2023],
      "lat": -37.8497,
      "long": 144.968,
      "locationCity": "Melbourne",
      "locationCountry": "Australia",
      "numberOfLaps": 58,
      "raceDistance": 306.124,
      "fastestLapTime": "1:20.235",
      "fastestLapDriver": "Sergio Perez",
      "fastestLapYear": "2023",
      "fastestLapTeam": "Red Bull Racing",
      "inCurrentSeason": true,
      "trackLayoutImage": "albert_park.png",
      "historicalImages": ["albert_park_001.webp", "albert_park_002.jpeg", "albert_park_003.jpeg" ],
      "firstParagraph": "The Australian Grand Prix held in Melbourne is a renowned event in the world of Formula 1. The Albert Park Circuit, situated around Albert Park Lake, provides a picturesque setting for the race. The track stretches over 5.3 kilometers and features a combination of fast straights, tight corners, and challenging braking zones. Its semi-permanent design utilizes public roads, creating a unique blend of high-speed sections and technical challenges. The circuit's layout demands precision and skill from the drivers, making it a favorite among fans and competitors alike.",
      "secondParagraph": "Over the years, the Australian Grand Prix has witnessed several memorable races. One such notable race occurred in 1994 when Ayrton Senna, a legendary Formula 1 driver, tragically lost his life during the event. This incident sent shockwaves through the motorsport community and forever marked the history of the Australian Grand Prix. In subsequent years, the race has seen thrilling battles and dramatic moments, including intense wheel-to-wheel duels and unexpected upsets. These exciting races have solidified the Australian Grand Prix as a must-watch event on the Formula 1 calendar.",
      "thirdParagraph": "The history of the Australian Grand Prix in Melbourne dates back to 1996 when it moved from Adelaide to its current location. Since then, the race has become an integral part of the Formula 1 season, serving as the opening round for many years. Melbourne's passion for motorsport is evident in the city's enthusiastic support for the event, with fans flocking to Albert Park to witness the exhilarating races firsthand. The Australian Grand Prix has not only showcased the skills of the world's best drivers but also provided a platform for the latest technological advancements in Formula 1. With a rich history spanning several decades, the Australian Grand Prix at Melbourne has left an indelible mark on the sport."
    },
    {
      "officialRaceName": "Circuit of the Americas",
      "circuitId": "americas",
      "trackStartDate": "2012",
      "years": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2021, 2022, 2023],
      "lat": 30.1328,
      "long": -97.6411,
      "locationCity": "Austin",
      "locationCountry": "USA",
      "numberOfLaps": 56,
      "raceDistance": 308.405,
      "fastestLapTime": "1:43.009",
      "fastestLapDriver": "Charles Leclerc",
      "fastestLapYear": "2019",
      "fastestLapTeam": "Ferrari",
      "inCurrentSeason": true,
      "trackLayoutImage": "americas.png",
      "historicalImages": [],
      "firstParagraph": "The Circuit of the Americas (COTA) in Austin, Texas, has been hosting the United States Grand Prix since its inception in 2012. The track is a favorite among drivers and fans alike, offering a challenging and exhilarating racing experience. Spanning 5.5 kilometers, the circuit boasts a diverse layout that includes high-speed straights, technical corners, and elevation changes. Its undulating nature demands precision and skill, making it a thrilling venue for Formula 1 races. Notably, Turn 1, a steep uphill corner, has become an iconic feature of the track, testing drivers' courage and expertise. With its modern facilities and impressive design, COTA provides an exceptional setting for the United States Grand Prix.",
      "secondParagraph": "Over the years, the United States Grand Prix at COTA has witnessed numerous unforgettable races. One standout event occurred in 2012, during the inaugural year, when Lewis Hamilton and Sebastian Vettel engaged in a captivating battle for the lead. The race featured intense wheel-to-wheel duels and strategic maneuvers, captivating spectators until the very end. Another notable race took place in 2018 when Kimi Räikkönen claimed a popular victory, becoming the oldest driver to win a Grand Prix since 2013. These thrilling races have solidified COTA's reputation as a circuit that produces memorable moments and showcases the highest level of racing in Formula 1.",
      "thirdParagraph": "The history of the Circuit of the Americas as a Formula 1 venue dates back to 2012. The track's creation was a significant milestone for motorsport in the United States, marking the first purpose-built Formula 1 circuit in the country since the iconic Indianapolis Motor Speedway. The introduction of the United States Grand Prix at COTA brought the excitement of Formula 1 to American soil, attracting a passionate and growing fan base. The track's modern infrastructure and state-of-the-art facilities, combined with its challenging layout, have earned it a place as a prominent venue on the Formula 1 calendar. As the years have passed, the Circuit of the Americas has continued to leave a lasting impact on the sport, combining thrilling racing action with the warm Texan hospitality, making it a must-visit destination for motorsport enthusiasts from around the world."
    },
    {
      "officialRaceName": "Gulf Air Bahrain Grand Prix",
      "circuitId": "bahrain",
      "trackStartDate": "2004",
      "years": [2004, 2005, 2006, 2007, 2008, 2009, 2010, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023],
      "lat": 26.0325,
      "long": 50.5106,
      "locationCity": "Sakhir",
      "locationCountry": "Bahrain",
      "numberOfLaps": 57,
      "raceDistance": 308.238,
      "fastestLapTime": "1:31:447",
      "fastestLapDriver": "Pedro de la Rosa",
      "fastestLapYear": "2005",
      "fastestLapTeam": "McLaren",
      "inCurrentSeason": true,
      "trackLayoutImage": "bahrain.png",
      "historicalImages": [],
      "firstParagraph": "The Bahrain Grand Prix is a prestigious event on the Formula 1 calendar, hosted at the Bahrain International Circuit in Sakhir. The track is known for its modern facilities and unique characteristics. Spanning 5.4 kilometers, the circuit features a combination of fast straights, challenging braking zones, and technical sections. Its desert location adds an additional challenge, as sand and wind can affect track conditions. The Bahrain International Circuit also boasts an impressive lighting system, allowing for thrilling night races, creating a captivating spectacle for both drivers and spectators.",
      "secondParagraph": "Notable races at the Bahrain Grand Prix have provided fans with thrilling moments and unexpected outcomes. In 2014, the race witnessed an intense battle between Mercedes teammates Lewis Hamilton and Nico Rosberg. The two drivers engaged in a wheel-to-wheel fight, resulting in contact that punctured Rosberg's tire and compromised his chances of victory. The race showcased the competitive spirit and fierce rivalry within the team. Another unforgettable race occurred in 2020 when the Bahrain Grand Prix was held on the circuit's outer layout. Romain Grosjean, a Haas F1 driver, miraculously escaped a horrifying crash that saw his car split in two and catch fire. The incident highlighted the importance of safety measures in Formula 1 and demonstrated the resilience and bravery of the drivers.",
      "thirdParagraph": "The Bahrain Grand Prix made its Formula 1 debut in 2004, becoming the first race in the Middle East to be included in the championship. The event has played a crucial role in promoting motorsport and fostering the growth of Formula 1 in the region. Over the years, Bahrain International Circuit has established itself as a world-class venue, hosting not only the Grand Prix but also pre-season testing and other motorsport events. The circuit's combination of technical challenges and stunning desert backdrop has made it a favorite among drivers and fans. The Bahrain Grand Prix continues to be an exciting addition to the Formula 1 calendar, attracting international attention and adding to the rich history of the sport."
    },
    {
      "officialRaceName": "Baku City Circuit",
      "circuitId": "baku",
      "trackStartDate": "2016",
      "years": [2016, 2017, 2018, 2019, 2021, 2022, 2023],
      "lat": 40.3725,
      "long": 49.8533,
      "locationCity": "Baku",
      "locationCountry": "Azerbaijan",
      "numberOfLaps": 51,
      "raceDistance": 306.049,
      "fastestLapTime": "1:43.009",
      "fastestLapDriver": "Charles Leclerc",
      "fastestLapYear": "2019",
      "fastestLapTeam": "Ferrari",
      "inCurrentSeason": true,
      "trackLayoutImage": "baku.png",
      "historicalImages": [],
      "firstParagraph": "The Baku City Circuit, home to the Baku Grand Prix, is a unique street circuit that winds through the city streets of Baku, the capital of Azerbaijan. Stretching over 6 kilometers, the track offers a thrilling and picturesque setting. It features a combination of long straights, tight corners, and narrow sections, presenting a challenging and technical layout for Formula 1 drivers. The track's tight corners and limited overtaking opportunities demand precise and strategic driving. Moreover, the Baku City Circuit is known for its iconic sections, such as the long straight of the Start-Finish line, the historic old city walls, and the tricky narrow section known as the Castle Section. With its scenic urban backdrop and demanding track design, the Baku City Circuit provides an exhilarating experience for both competitors and spectators.",
      "secondParagraph": "The Baku Grand Prix has witnessed several memorable races since its inception in 2016. One notable race occurred in 2017 when Red Bull Racing teammates Daniel Ricciardo and Max Verstappen engaged in a dramatic battle for victory. The two drivers showcased their exceptional skills as they fought wheel-to-wheel, producing heart-stopping overtakes and thrilling maneuvers. In the end, Ricciardo emerged as the victor, securing an unforgettable win. Another memorable race took place in 2018 when Mercedes driver Lewis Hamilton emerged victorious after an eventful contest. The race was marked by multiple safety car periods and surprises, making it a thrilling and unpredictable event for both fans and drivers.",
      "thirdParagraph": "The Baku City Circuit made its Formula 1 debut in 2016, becoming the newest street circuit on the calendar. The race quickly gained popularity for its unique blend of challenging corners, high-speed sections, and stunning cityscape. The Baku Grand Prix has played a significant role in promoting Azerbaijan as a destination for international motorsport events. The circuit showcases the country's rich history and culture while providing a thrilling racing experience. Since its inception, the Baku City Circuit has earned a reputation for producing exciting and unpredictable races, adding to the allure and history of Formula 1."
    },
    {
      "officialRaceName": "Circuit de Barcelona-Catalunya",
      "circuitId": "catalunya",
      "trackStartDate": "1991",
      "years": [1991, 1992, 1993, 1994, 1995, 1996, 1997, 1999, 2000, 2001, 2002, 2003, 2004, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2014, 2015, 2016, 2017, 2018, 2019, 2021, 2022, 2023],
      "lat": 41.57,
      "long": 2.26111,
      "locationCity": "Montmeló",
      "locationCountry": "Spain",
      "numberOfLaps": 66,
      "raceDistance": 307.104,
      "fastestLapTime": "1:18.441",
      "fastestLapDriver": "Daniel Ricciardo",
      "fastestLapYear": "2018",
      "fastestLapTeam": "Red Bull Racing",
      "inCurrentSeason": true,
      "trackLayoutImage": "catalunya.png",
      "historicalImages": [],
      "firstParagraph": "The Circuit de Barcelona-Catalunya, located in Montmelo, Spain, is a prominent venue for the Formula 1 Spanish Grand Prix. The track serves as both a testing ground for Formula 1 teams and a challenging racing circuit. Spanning 4.7 kilometers, the circuit features a balanced mix of high-speed straights, sweeping corners, and technical sections. Its layout allows drivers to showcase their skills and test the limits of their cars. The circuit's abrasive surface and variable weather conditions add an additional level of complexity, requiring teams to adapt their strategies throughout the race. With its modern facilities and spectator-friendly design, Circuit de Barcelona-Catalunya provides an exciting and engaging experience for both drivers and fans.",
      "secondParagraph": "Over the years, the Circuit de Barcelona-Catalunya has witnessed numerous noteworthy races. One standout race occurred in 2016 when Max Verstappen, driving for Red Bull Racing, made history by becoming the youngest driver to win a Formula 1 Grand Prix. Verstappen's remarkable performance included bold overtakes and exceptional racecraft, earning him a well-deserved victory. Additionally, the circuit has seen intense battles among the top teams, such as Mercedes, Ferrari, and Red Bull Racing, with strategic duels and thrilling on-track action. The Spanish Grand Prix at Circuit de Barcelona-Catalunya consistently provides exciting moments and unpredictable outcomes, captivating fans around the world.",
      "thirdParagraph": "The history of the Circuit de Barcelona-Catalunya dates back to 1991 when it hosted its first Formula 1 race. Since then, the circuit has become a regular feature on the Formula 1 calendar, known for its technical layout and demanding nature. Not only does the circuit host the Spanish Grand Prix, but it also serves as a crucial venue for pre-season testing, allowing teams to fine-tune their cars ahead of the championship. Circuit de Barcelona-Catalunya's central location in Europe makes it easily accessible for teams and fans, further enhancing its significance in the world of Formula 1. With a rich history of thrilling races and an important role in the development of Formula 1 machinery, the Circuit de Barcelona-Catalunya has become an integral part of the motorsport landscape."
    },
    {
      "officialRaceName": "Hungaroring",
      "circuitId": "hungaroring",
      "trackStartDate": "1986",
      "years": [1986, 1987, 1988, 1989, 1990, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2018, 2019, 2020, 2021, 2022, 2023],
      "lat": 47.5789,
      "long": 19.2486,
      "locationCity": "Budapest",
      "locationCountry": "Hungary",
      "numberOfLaps": 70,
      "raceDistance": 306.63,
      "fastestLapTime": "1:16.627",
      "fastestLapDriver": "Lewis Hamilton",
      "fastestLapYear": "2020",
      "fastestLapTeam": "Mercedes",
      "inCurrentSeason": true,
      "trackLayoutImage": "hungaroring.png",
      "historicalImages": [],
      "firstParagraph": "The Hungaroring, situated in Mogyoród near Budapest, Hungary, is a renowned circuit that hosts the Formula 1 Hungarian Grand Prix. The track, known for its tight and twisty nature, provides a unique challenge for drivers. Spanning 4.4 kilometers, the circuit features a series of slow to medium-speed corners, with limited overtaking opportunities. The technical layout demands precise car control and strategic driving, rewarding skill and consistency over pure speed. The circuit's location in a natural amphitheater offers excellent viewing opportunities for spectators, creating a vibrant atmosphere during race weekends. With its demanding nature and picturesque surroundings, the Hungaroring offers an exciting and unpredictable experience for Formula 1 competitors.",
      "secondParagraph": "Throughout its history, the Hungaroring has witnessed memorable races that have left an indelible mark on Formula 1. One notable race occurred in 1997 when a torrential downpour created treacherous track conditions. The race became a battle of attrition, with numerous incidents and retirements. Ultimately, Damon Hill secured a memorable victory in challenging circumstances, showcasing his skill in the wet. Another remarkable race took place in 2019 when Max Verstappen, driving for Red Bull Racing, produced an outstanding performance to secure victory. Verstappen's strategic overtakes and exceptional racecraft demonstrated his mastery of the circuit, thrilling fans with an incredible display of skill and determination.",
      "thirdParagraph": "The Hungaroring made its Formula 1 debut in 1986, becoming the first venue to host a Grand Prix behind the Iron Curtain. The circuit quickly gained popularity for its challenging layout and enthusiastic local fan base. The Hungarian Grand Prix has since become a staple on the Formula 1 calendar, attracting a global audience to Budapest. The Hungaroring's history is filled with moments of triumph and heartbreak, and it has played host to iconic battles among Formula 1's greatest drivers and teams. As one of the few circuits to offer limited overtaking opportunities, the Hungaroring often tests the drivers' ability to navigate through traffic and maximize their performance in a demanding environment. With its rich heritage and thrilling races, the Hungaroring remains an integral part of the Formula 1 championship."
    },
    {
      "officialRaceName": "Autódromo José Carlos Pace",
      "circuitId": "interlagos",
      "trackStartDate": "1973",
      "years": [1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2018, 2019, 2020, 2021, 2022, 2023],
      "lat": -23.7036,
      "long": -46.6997,
      "locationCity": "São Paulo",
      "locationCountry": "Brazil",
      "numberOfLaps": 71,
      "raceDistance": 305.879,
      "fastestLapTime": "1:10.540",
      "fastestLapDriver": "Valtteri Bottas",
      "fastestLapYear": "2018",
      "fastestLapTeam": "Mercedes",
      "inCurrentSeason": true,
      "trackLayoutImage": "interlagos.png",
      "historicalImages": [],
      "firstParagraph": "The Autódromo José Carlos Pace, commonly known as Interlagos, is a legendary circuit located in São Paulo, Brazil, and is the venue for the Formula 1 Brazilian Grand Prix. Spanning 4.3 kilometers, the track is known for its challenging and undulating layout. It features a mix of long straights, high-speed corners, and technical sections that demand precision and skill from the drivers. The circuit's anti-clockwise direction adds an additional physical and mental challenge. The weather conditions in São Paulo can be unpredictable, with sudden changes in temperature and rainfall, making it a thrilling and unpredictable circuit that tests the drivers' adaptability and the teams' strategic decision-making. With its rich history and passionate local fans, Interlagos offers an electrifying atmosphere for both drivers and spectators.",
      "secondParagraph": "The Brazilian Grand Prix at Interlagos has provided numerous memorable races over the years. One iconic race occurred in 2008 when Felipe Massa, a Brazilian driver, came tantalizingly close to winning the championship on home soil. Massa dominated the race, leading until the final seconds, only to lose the title by a single point to Lewis Hamilton. The race showcased the emotional rollercoaster that motorsport can offer and solidified Interlagos' status as a venue that often delivers dramatic moments. Another notable race took place in 2019 when Max Verstappen, driving for Red Bull Racing, secured victory with a stunning overtaking maneuver on the final lap. The race highlighted the circuit's overtaking opportunities and provided fans with an exciting conclusion to the season.",
      "thirdParagraph": "The Autódromo José Carlos Pace has a rich history in Formula 1. It made its debut on the Formula 1 calendar in 1973 and has been a favorite among drivers and fans ever since. Named in honor of Brazilian driver José Carlos Pace, who tragically lost his life in a plane crash in 1977, the circuit has become an iconic venue in the sport. Interlagos has witnessed legendary battles and championship-deciding moments, making it a special place in Formula 1 folklore. The circuit's passionate local fans, known for their enthusiasm and love for the sport, create a unique atmosphere that adds to the magic of the Brazilian Grand Prix. With its challenging layout and rich history, Interlagos remains an essential destination on the Formula 1 calendar, attracting global attention and providing unforgettable racing moments."
    },
    {
      "officialRaceName": "STC Saudi Arabian Grand Prix",
      "circuitId": "jeddah",
      "trackStartDate": "2021",
      "years": [2021, 2022, 2023],
      "lat": 21.6319,
      "long": 39.1044,
      "locationCity": "Jeddah",
      "locationCountry": "Saudi Arabia",
      "numberOfLaps": 50,
      "raceDistance": 3.836,
      "fastestLapTime": "1:30:734",
      "fastestLapDriver": "Lewis Hamilton",
      "fastestLapYear": "2021",
      "fastestLapTeam": "Mercedes",
      "inCurrentSeason": true,
      "trackLayoutImage": "jeddah.png",
      "historicalImages": [],
      "firstParagraph": "The Jeddah Circuit in Saudi Arabia is a newly introduced venue set to host the Formula 1 Saudi Arabian Grand Prix. Spanning approximately 6.175 kilometers, the track is designed to be the fastest street circuit in Formula 1, featuring long straights and a combination of high-speed and technical sections. The circuit's layout winds its way along the picturesque Jeddah Corniche, providing a stunning backdrop for the race. With its high-speed nature and challenging corners, the Jeddah Circuit promises to test the skills and bravery of drivers, offering an exhilarating experience for both participants and spectators.",
      "secondParagraph": "As a new addition to the Formula 1 calendar, the Jeddah Circuit has yet to witness notable races. However, its inaugural race in 2021 garnered significant attention as drivers and teams grappled with the unique demands of the track. The high-speed nature of the circuit created opportunities for thrilling overtakes and strategic battles, leading to an exciting spectacle for fans. With each passing year, the Saudi Arabian Grand Prix at the Jeddah Circuit has the potential to produce memorable moments and become a favorite among drivers and fans alike.",
      "thirdParagraph": "The Jeddah Circuit made its debut in the world of Formula 1 in 2021, marking Saudi Arabia's entry into the prestigious motorsport championship. The introduction of the Saudi Arabian Grand Prix signifies the country's commitment to expanding its sporting portfolio and promoting tourism through high-profile events. The Jeddah Circuit's modern facilities and impressive design reflect Saudi Arabia's ambition to host world-class sporting events. With its strategic location and commitment to delivering an exceptional racing experience, the Jeddah Circuit has quickly become an exciting addition to the Formula 1 calendar, poised to make its mark on the history of the sport."
    },
    {
      "officialRaceName": "Losail International Circuit",
      "circuitId": "losail",
      "trackStartDate": "2021",
      "years": [2021, 2022, 2023],
      "lat": 25.49,
      "long": 51.4542,
      "locationCity": "Al Daayen",
      "locationCountry": "Qatar",
      "numberOfLaps": 57,
      "raceDistance": 308.826,
      "fastestLapTime": "1:23.196",
      "fastestLapDriver": "Max Verstappen",
      "fastestLapYear": "2021",
      "fastestLapTeam": "Red Bull Racing",
      "inCurrentSeason": true,
      "trackLayoutImage": "loosail.png",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Marina Bay Street Circuit",
      "circuitId": "marina_bay",
      "trackStartDate": "",
      "lat": 1.2914,
      "long": 103.864,
      "locationCity": "Marina Bay",
      "locationCountry": "Singapore",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Miami International Autodrome",
      "circuitId": "miami",
      "trackStartDate": "",
      "lat": 25.9581,
      "long": -80.2389,
      "locationCity": "Miami",
      "locationCountry": "USA",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Circuit de Monaco",
      "circuitId": "monaco",
      "trackStartDate": "",
      "lat": 43.7347,
      "long": 7.42056,
      "locationCity": "Monte-Carlo",
      "locationCountry": "Monaco",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Autodromo Nazionale di Monza",
      "circuitId": "monza",
      "trackStartDate": "",
      "lat": 45.6156,
      "long": 9.28111,
      "locationCity": "Monza",
      "locationCountry": "Italy",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Red Bull Ring",
      "circuitId": "red_bull_ring",
      "trackStartDate": "",
      "lat": 47.2197,
      "long": 14.7647,
      "locationCity": "Spielberg",
      "locationCountry": "Austria",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Autódromo Hermanos Rodríguez",
      "circuitId": "rodriguez",
      "trackStartDate": "",
      "lat": 19.4042,
      "long": -99.0907,
      "locationCity": "Mexico City",
      "locationCountry": "Mexico",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Silverstone Circuit",
      "circuitId": "silverstone",
      "trackStartDate": "",
      "lat": 52.0786,
      "long": -1.01694,
      "locationCity": "Silverstone",
      "locationCountry": "UK",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Circuit de Spa-Francorchamps",
      "circuitId": "spa",
      "trackStartDate": "",
      "lat": 50.4372,
      "long": 5.97139,
      "locationCity": "Spa",
      "locationCountry": "Belgium",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Suzuka Circuit",
      "circuitId": "suzuka",
      "trackStartDate": "",
      "lat": 34.8431,
      "long": 136.541,
      "locationCity": "Suzuka",
      "locationCountry": "Japan",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Canada",
      "circuitId": "villeneuve",
      "trackStartDate": "",
      "lat": 1.2914,
      "long": 103.864,
      "locationCity": "Marina Bay",
      "locationCountry": "Singapore",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Las Vegas",
      "circuitId": "vegas",
      "trackStartDate": "",
      "lat": 1.2914,
      "long": 103.864,
      "locationCity": "Las Vegas",
      "locationCountry": "United States",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "",
      "circuitId": "yas_marina",
      "trackStartDate": "",
      "lat": 1.2914,
      "long": 103.864,
      "locationCity": "Yas Island",
      "locationCountry": "Abu Dhabi",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    },
    {
      "officialRaceName": "Zandvoort",
      "circuitId": "zandvoort",
      "trackStartDate": "",
      "lat": 1.2914,
      "long": 103.864,
      "locationCity": "Zandvoort",
      "locationCountry": "Netherlands",
      "numberOfLaps": null,
      "raceDistance": null,
      "fastestLapTime": "",
      "fastestLapDriver": "",
      "fastestLapYear": "",
      "fastestLapTeam": "",
      "inCurrentSeason": true,
      "trackLayoutImage": "",
      "historicalImages": [],
      "firstParagraph": "",
      "secondParagraph": "",
      "thirdParagraph": ""
    }
  ]
